"TCPConnecting%s%i" = "Connecting to %s:%i...";

"TCPInitError" = "Could not initialize connection.";
"TCPInitError%@" = "Could not initialize connection: %@.";
"TCPConnectError" = "Could not connect.";
"TCPConnectError%@" = "Could not connect: %@.";
"TCPReadError" = "TCP read failed.";
"TCPReadError%@" = "TCP read failed: %@.";
"TCPWriteError" = "TCP send failed.";
"TCPWriteError%@" = "TCP send failed: %@.";

"DNSLookup%@" = "Looking up %@...";
"DNSLookup%@Error%@" = "Could not lookup %@: %@.";
"domain name unknown" = "domain name unknown";
"internal DNS lookup error" = "internal DNS lookup error";

"WillReconnectAfter%f" = "Reconnecting in %g seconds...";
"ReconnectCancelled" = "Reconnect cancelled.";

"MWLogger" = "Logger";
"MWTeeFilter" = "Tee";
"MWNSFileHandleConnection" = "Connection";

"MWURLFormatter-invalid" = "Incorrect URL format (possibly contains spaces or other disallowed character).";
"MWURLFormatter-noScheme" = "URL has no protocol (e.g. ‘telnet’, ‘cgmud’, or ‘http’) specified.";
"MWURLFormatter-noHost" = "URL has no host name specified.";
"MWURLFormatter-noPort" = "URL has no port number specified.";

"MWFontSelectorView-noFont" = "(no font)";

/* script language */
"BaseIdentity" = "Literal Text";